{
  "intents": [
    {
      "tag": "stop_smoking",
      "patterns": [
        "How do I stop smoking?",
        "I want to quit smoking.",
        "What is the best way to stop smoking?"
      ],
      "responses": [
        "Stopping smoking requires willpower and being steadfast. You can stop safely by using bupropion or a nicotine patch under a doctor’s guidance.",
        "Consult an addiction clinic near you for additional support. Wishing you the best in your journey to quit smoking!",
        "It's great that you want to stop smoking! Talk to a healthcare provider for advice on nicotine replacement therapies or medications like bupropion."
      ]
    },
    {
      "tag": "missed_period",
      "patterns": [
        "My period stopped for three months, what could be wrong?",
        "I haven’t had a period in months but I’m not pregnant.",
        "Why has my period stopped suddenly?"
      ],
      "responses": [
        "It’s essential to consult your doctor for hormonal tests like thyroid or prolactin levels to assess the cause of your missed periods.",
        "A tubal ligation makes pregnancy unlikely, but a thorough evaluation by a doctor is recommended.",
        "Endometriosis is an unlikely cause for completely stopping your cycle. Please visit your doctor for an examination."
      ]
    },
    {
      "tag": "breast_tenderness",
      "patterns": [
        "Can caffeine cause breast tenderness?",
        "Why do I have pain in one breast after drinking coffee?",
        "Does caffeine lead to chest discomfort?"
      ],
      "responses": [
        "Excess caffeine can cause gastric discomfort, which may result in breast or chest pain. Consult your doctor for a local evaluation.",
        "Mild unilateral breast tenderness might be linked to your caffeine intake. Stay in touch with your healthcare provider for further guidance.",
        "While caffeine can cause discomfort, other conditions like mastitis should also be ruled out by a healthcare professional."
      ]
    },
    {
      "tag": "farewell",
      "patterns": ["Goodbye", "Bye", "See you later", "Thank you"],
      "responses": [
        "Goodbye! Take care.",
        "Bye! Feel free to ask if you have more questions.",
        "Thank you! Have a great day!"
      ]
    },
    {
      "tag": "blood_cancer",
      "patterns": [
        "What are the symptoms of blood cancer?",
        "How is blood cancer diagnosed?",
        "Can leukemia be treated?",
        "What causes blood cancer?",
        "Is blood cancer hereditary?"
      ],
      "responses": [
        "Blood cancer symptoms can include fatigue, fever, weight loss, and easy bruising. Consult a hematologist for an accurate diagnosis.",
        "Blood cancer is diagnosed using blood tests, bone marrow tests, and imaging studies like CT scans. Talk to your doctor for guidance.",
        "Treatment for blood cancer depends on the type and stage. It may involve chemotherapy, radiation, or a bone marrow transplant. Seek medical advice for more details.",
        "The exact cause of blood cancer isn't fully understood, but genetic factors and exposure to certain chemicals or radiation may play a role.",
        "Some types of blood cancer can have hereditary components, but other factors like lifestyle and environment also contribute."
      ]
    },
    {
      "tag": "brain_tumor",
      "patterns": [
        "What are the signs of a brain tumor?",
        "How is a brain tumor treated?",
        "Can headaches indicate a brain tumor?",
        "What causes brain tumors?",
        "Is surgery always required for brain tumors?"
      ],
      "responses": [
        "Brain tumor symptoms can include persistent headaches, nausea, vision changes, and difficulty speaking or walking. Consult a neurologist for an evaluation.",
        "Treatment for brain tumors depends on the type, size, and location. Options include surgery, radiation therapy, and chemotherapy. Seek medical advice for tailored recommendations.",
        "Frequent headaches can be a symptom of a brain tumor, but many other conditions cause headaches. It's best to consult a healthcare provider for clarification.",
        "The causes of brain tumors can vary. Some may be linked to genetic factors or radiation exposure, but the exact causes aren't always clear.",
        "Surgery is not always required for brain tumors. Some may be treated with medications, radiation, or other therapies. Consult a specialist to discuss your options."
      ]
    },
    {
      "tag": "fever",
      "patterns": [
        "What are the symptoms of a fever?",
        "How can I treat a fever at home?",
        "What causes a fever?",
        "When should I see a doctor for a fever?",
        "Can a fever indicate something serious?"
      ],
      "responses": [
        "Fever symptoms include an elevated body temperature, sweating, chills, headache, and muscle aches. Monitor your temperature and rest.",
        "To treat a fever at home, stay hydrated, rest, and take over-the-counter medications like acetaminophen or ibuprofen if necessary. Consult a doctor if symptoms persist.",
        "A fever is often caused by infections like the flu, colds, or other viral or bacterial conditions. It's the body's way of fighting illness.",
        "You should see a doctor for a fever if it lasts more than three days, exceeds 103°F (39.4°C), or is accompanied by severe symptoms like confusion or difficulty breathing.",
        "A fever can indicate a serious condition such as a severe infection or inflammatory disease. Consult a doctor if you're concerned about the cause."
      ]
    },
    {
      "tag": "cold",
      "patterns": [
        "What are the symptoms of a common cold?",
        "How can I treat a cold at home?",
        "Can a cold turn into something serious?",
        "What causes the common cold?",
        "How long does a cold last?"
      ],
      "responses": [
        "Symptoms of a common cold include a runny or stuffy nose, sore throat, cough, sneezing, mild fever, and body aches. Rest and hydration can help.",
        "To treat a cold at home, drink plenty of fluids, rest, and use over-the-counter remedies for symptoms like a sore throat or congestion.",
        "A cold is usually mild, but in some cases, it can lead to complications like sinus infections or bronchitis, especially in individuals with weakened immune systems.",
        "The common cold is caused by viruses, most commonly rhinoviruses. It spreads through droplets from coughs, sneezes, or close contact with infected individuals.",
        "A cold typically lasts 7-10 days, although symptoms may improve sooner with proper care and rest."
      ]
    },
    {
      "tag": "headache",
      "patterns": [
        "What causes headaches?",
        "How can I relieve a headache?",
        "Can stress lead to headaches?",
        "When should I worry about a headache?",
        "Are headaches a sign of something serious?"
      ],
      "responses": [
        "Headaches can be caused by stress, dehydration, lack of sleep, eye strain, or underlying health conditions. Identifying triggers can help manage them.",
        "To relieve a headache, rest in a quiet, dark room, stay hydrated, and take over-the-counter pain relievers if needed. Relaxation techniques can also help.",
        "Yes, stress is a common cause of tension headaches. Practicing stress management and relaxation exercises can help prevent them.",
        "You should seek medical attention for a headache if it is sudden and severe, persistent, or accompanied by symptoms like confusion, vision changes, or fever.",
        "While most headaches are harmless, they can sometimes indicate serious conditions like migraines, infections, or neurological issues. Consult a doctor if you're unsure."
      ]
    },
    {
      "tag": "ulcer",
      "patterns": [
        "What are the symptoms of an ulcer?",
        "How is an ulcer treated?",
        "What causes stomach ulcers?",
        "Can stress cause ulcers?",
        "Is an ulcer serious?"
      ],
      "responses": [
        "Symptoms of an ulcer include burning stomach pain, bloating, nausea, and, in severe cases, vomiting blood or black stools. Seek medical advice if you notice these symptoms.",
        "Ulcers are typically treated with medications like antacids, proton pump inhibitors, or antibiotics for H. pylori infections. Lifestyle changes can also help.",
        "Stomach ulcers are often caused by H. pylori bacteria or long-term use of NSAIDs like ibuprofen. Smoking and excessive alcohol use can also contribute.",
        "Stress alone is not a direct cause of ulcers but can exacerbate symptoms or contribute to other factors like acid reflux.",
        "Most ulcers can be treated effectively, but if left untreated, they can lead to complications like bleeding or perforation. Consult a doctor for proper care."
      ]
    },
    {
      "tag": "abdominal_aortic_aneurysm",
      "patterns": [
        "What is an abdominal aortic aneurysm?",
        "What are the symptoms of an abdominal aortic aneurysm?",
        "How is an abdominal aortic aneurysm treated?",
        "What causes abdominal aortic aneurysms?",
        "Is an abdominal aortic aneurysm life-threatening?"
      ],
      "responses": [
        "An abdominal aortic aneurysm (AAA) is a bulge in the aorta, the main blood vessel that runs through the abdomen.",
        "Symptoms of an abdominal aortic aneurysm can include a pulsating feeling in the abdomen, deep pain, or back pain. Many aneurysms have no symptoms and are found during tests for other conditions.",
        "Treatment may involve monitoring, lifestyle changes, or surgery depending on the size and risk of rupture. Consult a vascular specialist for options.",
        "Factors like smoking, high blood pressure, and genetic predisposition can increase the risk of developing an abdominal aortic aneurysm.",
        "Yes, an untreated AAA can rupture, leading to life-threatening internal bleeding. Immediate medical attention is critical if a rupture occurs."
      ]
    },
    {
      "tag": "achilles_tendinopathy",
      "patterns": [
        "What causes Achilles tendinopathy?",
        "What are the symptoms of Achilles tendinopathy?",
        "How do you treat Achilles tendinopathy?",
        "Is Achilles tendinopathy common in athletes?",
        "Can Achilles tendinopathy heal on its own?"
      ],
      "responses": [
        "Achilles tendinopathy is caused by overuse, strain, or repetitive stress on the Achilles tendon. It’s common in runners and athletes.",
        "Symptoms include pain, stiffness, and swelling in the back of the heel, especially after exercise or in the morning.",
        "Treatment involves rest, ice, physical therapy, and sometimes orthotics or supportive footwear. Severe cases may require further intervention.",
        "Yes, Achilles tendinopathy is common in athletes, especially those involved in running or jumping sports.",
        "Mild cases can heal with rest and proper care, but persistent pain may require medical treatment. Consult a healthcare provider for guidance."
      ]
    },
    {
      "tag": "acne",
      "patterns": [
        "What causes acne?",
        "How can acne be treated?",
        "Does diet affect acne?",
        "Can stress cause acne?",
        "Is acne common in adults?"
      ],
      "responses": [
        "Acne is caused by clogged hair follicles due to excess oil, bacteria, and dead skin cells. Hormonal changes can also contribute.",
        "Treatment options include over-the-counter products, prescription medications, and lifestyle changes. Consult a dermatologist for severe cases.",
        "Diet can influence acne in some people. High-glycemic foods and dairy may trigger breakouts in some individuals.",
        "Yes, stress can worsen acne by triggering hormonal changes that increase oil production.",
        "Acne is not just a teenage problem; it’s common in adults too, especially in women due to hormonal fluctuations."
      ]
    },
    {
      "tag": "acute_cholecystitis",
      "patterns": [
        "What is acute cholecystitis?",
        "What are the symptoms of acute cholecystitis?",
        "How is acute cholecystitis treated?",
        "What causes acute cholecystitis?",
        "Is acute cholecystitis an emergency?"
      ],
      "responses": [
        "Acute cholecystitis is the sudden inflammation of the gallbladder, usually caused by a gallstone blocking the bile duct.",
        "Symptoms include severe pain in the upper right abdomen, fever, nausea, and tenderness.",
        "Treatment often includes fasting, fluids, antibiotics, and sometimes surgery to remove the gallbladder.",
        "Acute cholecystitis is typically caused by gallstones, but other factors like infections or tumors can contribute.",
        "Yes, it can be a medical emergency requiring immediate treatment to prevent complications like infection or rupture."
      ]
    },
    {
      "tag": "acute_lymphoblastic_leukaemia",
      "patterns": [
        "What is acute lymphoblastic leukemia?",
        "What are the signs of ALL?",
        "How is ALL treated?",
        "Is ALL common in children?",
        "Can ALL be cured?"
      ],
      "responses": [
        "Acute lymphoblastic leukemia (ALL) is a cancer of the blood and bone marrow that progresses rapidly.",
        "Signs include fatigue, fever, frequent infections, bruising, and bone pain. Blood tests are needed for diagnosis.",
        "Treatment involves chemotherapy, radiation, and possibly stem cell transplants. It depends on the patient’s age and health.",
        "ALL is most common in children but can occur in adults too.",
        "ALL is curable in many cases, especially in children, with prompt and effective treatment."
      ]
    },
    {
      "tag": "acute_lymphoblastic_leukaemia_children",
      "patterns": [
        "What causes acute lymphoblastic leukemia in children?",
        "What are the symptoms of ALL in children?",
        "How is ALL treated in children?",
        "Can children recover from ALL?",
        "Is ALL in children common?"
      ],
      "responses": [
        "Acute lymphoblastic leukemia (ALL) in children is often caused by genetic mutations, though the exact cause is not always clear.",
        "Symptoms include pale skin, fatigue, frequent infections, bruising, bleeding gums, and bone pain.",
        "Treatment usually involves chemotherapy, targeted therapy, and sometimes radiation or stem cell transplants.",
        "Yes, children with ALL have high survival rates, especially with early diagnosis and proper treatment.",
        "ALL is the most common type of cancer in children, particularly in those under 15 years of age."
      ]
    },
    {
      "tag": "acute_lymphoblastic_leukaemia_teenagers_young_adults",
      "patterns": [
        "What are the symptoms of ALL in teenagers?",
        "How is ALL treated in young adults?",
        "Is ALL common in teenagers?",
        "What causes ALL in young adults?",
        "Can ALL be cured in young adults?"
      ],
      "responses": [
        "Symptoms in teenagers and young adults include fatigue, swollen lymph nodes, fever, frequent infections, and unexplained weight loss.",
        "Treatment typically involves intensive chemotherapy, sometimes followed by stem cell transplantation.",
        "ALL is less common in teenagers and young adults than in younger children, but it does occur.",
        "The exact cause is unknown, but it may involve genetic predispositions or environmental factors.",
        "With proper treatment, many teenagers and young adults can achieve remission and long-term survival."
      ]
    },
    {
      "tag": "acute_myeloid_leukaemia",
      "patterns": [
        "What is acute myeloid leukemia?",
        "What are the signs of AML?",
        "How is AML treated?",
        "Is AML common in adults?",
        "Can AML be cured?"
      ],
      "responses": [
        "Acute myeloid leukemia (AML) is a fast-growing cancer of the blood and bone marrow that affects immature blood cells.",
        "Signs include fatigue, shortness of breath, frequent infections, easy bruising, and bleeding gums.",
        "Treatment involves chemotherapy, targeted therapy, and possibly bone marrow or stem cell transplantation.",
        "AML is more common in adults, especially those over 60 years of age.",
        "AML can be cured, particularly in younger patients, with aggressive treatment and ongoing medical care."
      ]
    },
    {
      "tag": "acute_myeloid_leukaemia_children",
      "patterns": [
        "What causes acute myeloid leukemia in children?",
        "What are the symptoms of AML in children?",
        "How is AML treated in children?",
        "Can children recover from AML?",
        "Is AML common in children?"
      ],
      "responses": [
        "AML in children is often linked to genetic conditions or prior exposure to chemotherapy, though the exact cause is unclear.",
        "Symptoms include tiredness, paleness, frequent infections, fever, and unusual bleeding or bruising.",
        "Treatment typically involves intensive chemotherapy, sometimes followed by a stem cell transplant.",
        "Yes, with aggressive treatment, many children achieve remission, although the prognosis depends on individual factors.",
        "AML is less common in children compared to acute lymphoblastic leukemia (ALL)."
      ]
    },
    {
      "tag": "acute_myeloid_leukaemia_teenagers_young_adults",
      "patterns": [
        "What are the signs of AML in young adults?",
        "How is AML treated in teenagers?",
        "Is AML common in young adults?",
        "What causes AML in teenagers?",
        "Can AML be cured in young adults?"
      ],
      "responses": [
        "Signs of AML in young adults include fatigue, weight loss, frequent infections, and bruising or bleeding.",
        "Treatment involves chemotherapy and, in some cases, a stem cell transplant.",
        "AML is rare in teenagers and young adults but can still occur.",
        "The causes of AML are not always clear but may involve genetic predispositions or environmental exposure.",
        "With proper treatment, many young adults can achieve remission, but outcomes depend on specific disease characteristics."
      ]
    },
    {
      "tag": "atopic_eczema",
      "patterns": [
        "What is atopic eczema?",
        "What are the symptoms of atopic eczema?",
        "How is atopic eczema treated?",
        "Is atopic eczema genetic?",
        "Can atopic eczema be cured?"
      ],
      "responses": [
        "Atopic eczema is a chronic skin condition that causes inflammation, redness, and itching.",
        "Symptoms include dry, itchy, and inflamed skin, often on the face, hands, or inside elbows and knees.",
        "Treatment includes moisturizing creams, topical steroids, antihistamines, and avoiding triggers.",
        "Yes, atopic eczema often runs in families and may be linked to genetic and environmental factors.",
        "There is no cure for atopic eczema, but symptoms can be managed effectively with proper care."
      ]
    },
    {
      "tag": "asthma",
      "patterns": [
        "What is asthma?",
        "What are the symptoms of asthma?",
        "How is asthma treated?",
        "Can asthma attacks be prevented?",
        "Is asthma common in children?"
      ],
      "responses": [
        "Asthma is a chronic condition where the airways become inflamed and narrowed, causing breathing difficulties.",
        "Symptoms include wheezing, shortness of breath, chest tightness, and coughing, especially at night or early morning.",
        "Treatment involves inhalers (bronchodilators and corticosteroids) and managing triggers. Severe cases may require additional medication.",
        "Yes, asthma attacks can often be prevented by avoiding triggers and using prescribed medications as directed.",
        "Asthma is common in children and can persist into adulthood, but proper management helps reduce its impact."
      ]
    },
    {
      "tag": "acute_pancreatitis",
      "patterns": [
        "What is acute pancreatitis?",
        "What causes acute pancreatitis?",
        "What are the symptoms of acute pancreatitis?",
        "How is acute pancreatitis treated?",
        "Can acute pancreatitis be life-threatening?"
      ],
      "responses": [
        "Acute pancreatitis is a sudden inflammation of the pancreas that can cause severe abdominal pain.",
        "Common causes include gallstones, heavy alcohol use, high triglycerides, or certain medications.",
        "Symptoms include severe upper abdominal pain, nausea, vomiting, fever, and a swollen abdomen.",
        "Treatment typically involves hospitalization for pain management, fluids, and addressing the underlying cause, such as gallstones.",
        "Yes, in severe cases, acute pancreatitis can lead to life-threatening complications like organ failure or infection."
      ]
    },
    {
      "tag": "alcohol_related_liver_disease",
      "patterns": [
        "What is alcohol-related liver disease?",
        "What causes alcohol-related liver disease?",
        "What are the symptoms of alcohol-related liver disease?",
        "Can alcohol-related liver disease be reversed?",
        "How is alcohol-related liver disease treated?"
      ],
      "responses": [
        "Alcohol-related liver disease (ARLD) is liver damage caused by excessive alcohol consumption over time.",
        "It is caused by long-term alcohol use, which leads to fatty liver, inflammation (alcoholic hepatitis), or scarring (cirrhosis).",
        "Symptoms may include fatigue, weight loss, jaundice, abdominal pain, and swelling in the legs or abdomen.",
        "Early stages, like fatty liver, can be reversed by stopping alcohol use, but advanced stages, like cirrhosis, cause permanent damage.",
        "Treatment includes stopping alcohol use, proper nutrition, and medical interventions to manage symptoms or complications."
      ]
    },
    {
      "tag": "allergic_rhinitis",
      "patterns": [
        "What is allergic rhinitis?",
        "What causes allergic rhinitis?",
        "What are the symptoms of allergic rhinitis?",
        "How is allergic rhinitis treated?",
        "Can allergic rhinitis be cured?"
      ],
      "responses": [
        "Allergic rhinitis, also known as hay fever, is an allergic reaction to airborne allergens like pollen, dust, or pet dander.",
        "It is caused by an overreaction of the immune system to allergens, leading to inflammation in the nasal passages.",
        "Symptoms include sneezing, runny or stuffy nose, itchy eyes, throat, and nose, and watery eyes.",
        "Treatment options include antihistamines, nasal corticosteroids, decongestants, and avoiding allergen exposure.",
        "Allergic rhinitis cannot be cured, but symptoms can be effectively managed with treatment and lifestyle changes."
      ]
    },
    {
      "tag": "anal_cancer",
      "patterns": [
        "What is anal cancer?",
        "What causes anal cancer?",
        "What are the symptoms of anal cancer?",
        "How is anal cancer treated?",
        "Is anal cancer common?"
      ],
      "responses": [
        "Anal cancer is a rare type of cancer that develops in the tissues of the anus.",
        "The main causes include infection with the human papillomavirus (HPV), smoking, and a weakened immune system.",
        "Symptoms include rectal bleeding, pain, itching, a lump near the anus, or changes in bowel habits.",
        "Treatment options include surgery, radiation therapy, and chemotherapy, depending on the stage of the cancer.",
        "Anal cancer is not very common, but certain risk factors, like HPV infection, can increase its likelihood."
      ]
    },
    {
      "tag": "angina",
      "patterns": [
        "What is angina?",
        "What causes angina?",
        "What are the symptoms of angina?",
        "How is angina treated?",
        "Can angina lead to a heart attack?"
      ],
      "responses": [
        "Angina is chest pain or discomfort caused by reduced blood flow to the heart muscle.",
        "It is often caused by coronary artery disease due to plaque buildup in the arteries.",
        "Symptoms include chest pain or pressure, shortness of breath, and discomfort in the arms, neck, jaw, or back.",
        "Treatment includes medications, lifestyle changes, and sometimes procedures like angioplasty or bypass surgery.",
        "Yes, angina can be a warning sign of a heart attack, so it’s important to seek medical evaluation if symptoms occur."
      ]
    },
    {
      "tag": "arterial_thrombosis",
      "patterns": [
        "What is arterial thrombosis?",
        "What causes arterial thrombosis?",
        "What are the symptoms of arterial thrombosis?",
        "How is arterial thrombosis treated?",
        "Can arterial thrombosis be life-threatening?"
      ],
      "responses": [
        "Arterial thrombosis is the formation of a blood clot in an artery, which can block blood flow to vital organs.",
        "It is caused by conditions like atherosclerosis, high cholesterol, smoking, or injuries to the arterial wall.",
        "Symptoms depend on the affected area and may include sudden chest pain, stroke symptoms, or severe limb pain.",
        "Treatment involves clot-dissolving medications, blood thinners, and sometimes surgical procedures to remove the clot.",
        "Yes, arterial thrombosis can be life-threatening if it leads to a heart attack, stroke, or organ damage."
      ]
    },
    {
      "tag": "back_problems",
      "patterns": [
        "What are common causes of back problems?",
        "How can back pain be treated?",
        "What are the symptoms of a herniated disc?",
        "Can poor posture lead to back problems?",
        "How can I prevent back problems?"
      ],
      "responses": [
        "Back problems can be caused by muscle strain, herniated discs, poor posture, or conditions like arthritis.",
        "Treatment for back pain may include physical therapy, pain medications, exercise, or surgery in severe cases.",
        "Symptoms of a herniated disc include back pain, numbness, or weakness that may extend to the legs.",
        "Yes, poor posture can strain your back muscles and lead to chronic pain or other issues.",
        "Preventing back problems involves regular exercise, maintaining good posture, and avoiding heavy lifting without proper form."
      ]
    },
    {
      "tag": "bacterial_vaginosis",
      "patterns": [
        "What is bacterial vaginosis?",
        "What causes bacterial vaginosis?",
        "What are the symptoms of bacterial vaginosis?",
        "How is bacterial vaginosis treated?",
        "Can bacterial vaginosis go away on its own?"
      ],
      "responses": [
        "Bacterial vaginosis is an imbalance in the vaginal bacteria that can cause unusual discharge and odor.",
        "It is caused by an overgrowth of harmful bacteria, often triggered by douching, new sexual partners, or hormonal changes.",
        "Symptoms include a thin, gray or white vaginal discharge, a fishy odor, and mild itching or irritation.",
        "Treatment typically involves antibiotics prescribed by a healthcare provider.",
        "In some cases, mild bacterial vaginosis may resolve on its own, but treatment is recommended to prevent complications."
      ]
    },
    {
      "tag": "benign_prostate_enlargement",
      "patterns": [
        "What is benign prostate enlargement?",
        "What causes benign prostate enlargement?",
        "What are the symptoms of an enlarged prostate?",
        "How is benign prostate enlargement treated?",
        "Can an enlarged prostate cause complications?"
      ],
      "responses": [
        "Benign prostate enlargement (BPE) is a non-cancerous growth of the prostate gland that can affect urination.",
        "It is caused by hormonal changes as men age, particularly increased levels of dihydrotestosterone (DHT).",
        "Symptoms include frequent urination, weak urine flow, difficulty starting or stopping urination, and a feeling of incomplete bladder emptying.",
        "Treatment options include lifestyle changes, medications, minimally invasive procedures, or surgery in severe cases.",
        "Yes, untreated BPE can lead to complications like urinary retention, bladder infections, or kidney damage."
      ]
    },
    {
      "tag": "bile_duct_cancer",
      "patterns": [
        "What is bile duct cancer?",
        "What causes bile duct cancer?",
        "What are the symptoms of cholangiocarcinoma?",
        "How is bile duct cancer treated?",
        "Is bile duct cancer common?"
      ],
      "responses": [
        "Bile duct cancer, or cholangiocarcinoma, is a rare cancer that forms in the bile ducts connecting the liver to the small intestine.",
        "Risk factors include chronic inflammation of the bile ducts, liver flukes, and certain genetic conditions.",
        "Symptoms include jaundice, abdominal pain, weight loss, dark urine, and pale stools.",
        "Treatment options include surgery, chemotherapy, and sometimes liver transplantation.",
        "Bile duct cancer is rare but can be aggressive, making early detection important."
      ]
    },
    {
      "tag": "binge_eating",
      "patterns": [
        "What is binge eating?",
        "What causes binge eating disorder?",
        "What are the signs of binge eating?",
        "How is binge eating treated?",
        "Can binge eating be cured?"
      ],
      "responses": [
        "Binge eating disorder involves consuming large amounts of food in a short period, often with a feeling of loss of control.",
        "It can be caused by stress, emotional triggers, genetic factors, or past trauma.",
        "Signs include eating quickly, eating when not hungry, eating in secret, and feeling guilty or ashamed afterward.",
        "Treatment includes therapy (CBT), nutritional counseling, and sometimes medication to address underlying causes.",
        "Yes, with proper treatment and support, many people recover from binge eating disorder."
      ]
    },
    {
      "tag": "bipolar_disorder",
      "patterns": [
        "What is bipolar disorder?",
        "What causes bipolar disorder?",
        "What are the symptoms of bipolar disorder?",
        "How is bipolar disorder treated?",
        "Can bipolar disorder be managed?"
      ],
      "responses": [
        "Bipolar disorder is a mental health condition characterized by extreme mood swings, including manic and depressive episodes.",
        "The exact cause is unclear, but it may involve genetic, environmental, and neurological factors.",
        "Symptoms include periods of high energy and euphoria (mania) and periods of low energy, sadness, and hopelessness (depression).",
        "Treatment includes mood stabilizers, therapy, and lifestyle changes to manage triggers.",
        "Yes, with proper treatment and support, many individuals manage bipolar disorder effectively."
      ]
    },
    {
      "tag": "bladder_cancer",
      "patterns": [
        "What is bladder cancer?",
        "What causes bladder cancer?",
        "What are the symptoms of bladder cancer?",
        "How is bladder cancer treated?",
        "Is bladder cancer common?"
      ],
      "responses": [
        "Bladder cancer is a type of cancer that begins in the cells lining the bladder.",
        "Risk factors include smoking, exposure to certain chemicals, chronic bladder infections, and a family history of the disease.",
        "Symptoms include blood in the urine, frequent urination, pain during urination, and lower back pain.",
        "Treatment options include surgery, chemotherapy, radiation therapy, and immunotherapy.",
        "Bladder cancer is relatively common, especially in older adults, and early detection improves outcomes."
      ]
    },
    {
      "tag": "blood_poisoning",
      "patterns": [
        "What is blood poisoning?",
        "What causes sepsis?",
        "What are the symptoms of sepsis?",
        "How is sepsis treated?",
        "Can sepsis be fatal?"
      ],
      "responses": [
        "Blood poisoning, or sepsis, is a life-threatening condition caused by the body's extreme response to an infection.",
        "It can be caused by bacterial, viral, or fungal infections that spread through the bloodstream.",
        "Symptoms include high fever, rapid heart rate, confusion, low blood pressure, and difficulty breathing.",
        "Sepsis is treated with antibiotics, intravenous fluids, and sometimes oxygen or surgery to remove the infection source.",
        "Yes, sepsis can be fatal if not treated promptly, making early medical intervention critical."
      ]
    },
    {
      "tag": "bone_cancer",
      "patterns": [
        "What is bone cancer?",
        "What causes bone cancer?",
        "What are the symptoms of bone cancer?",
        "How is bone cancer treated?",
        "Is bone cancer rare?"
      ],
      "responses": [
        "Bone cancer is a rare type of cancer that starts in the bones, such as osteosarcoma or Ewing sarcoma.",
        "The exact cause is unknown, but genetic mutations or previous radiation exposure may play a role.",
        "Symptoms include persistent bone pain, swelling, fractures, and difficulty moving the affected limb.",
        "Treatment involves surgery, chemotherapy, and radiation therapy, depending on the type and stage of the cancer.",
        "Yes, bone cancer is rare, especially in adults, and early detection is key to better outcomes."
      ]
    },
    {
      "tag": "bone_cancer_teens",
      "patterns": [
        "What is bone cancer in teenagers?",
        "What are the symptoms of bone cancer in young adults?",
        "How is bone cancer treated in teenagers?",
        "Is bone cancer common in young people?",
        "What causes bone cancer in teenagers?"
      ],
      "responses": [
        "Bone cancer in teenagers is often osteosarcoma or Ewing sarcoma, which are more common in this age group.",
        "Symptoms include bone pain, swelling, fatigue, and unexplained fractures.",
        "Treatment includes surgery to remove the tumor, chemotherapy, and sometimes radiation therapy.",
        "Bone cancer is rare but more likely to occur during periods of rapid growth, such as adolescence.",
        "The causes are not fully understood but may involve genetic factors or previous radiation exposure."
      ]
    },
    {
      "tag": "bowel_cancer",
      "patterns": [
        "What is bowel cancer?",
        "What causes bowel cancer?",
        "What are the symptoms of bowel cancer?",
        "How is bowel cancer treated?",
        "Is bowel cancer preventable?"
      ],
      "responses": [
        "Bowel cancer, also called colorectal cancer, is cancer that starts in the colon or rectum.",
        "It is often caused by genetic mutations, a diet high in red or processed meat, obesity, smoking, or inflammatory bowel disease.",
        "Symptoms include blood in the stool, changes in bowel habits, unexplained weight loss, and abdominal pain.",
        "Treatment includes surgery, chemotherapy, radiation therapy, and targeted therapy depending on the stage of the cancer.",
        "Yes, bowel cancer can often be prevented with regular screenings, a healthy diet, and an active lifestyle."
      ]
    },
    {
      "tag": "bowel_incontinence",
      "patterns": [
        "What is bowel incontinence?",
        "What causes bowel incontinence?",
        "What are the symptoms of bowel incontinence?",
        "How is bowel incontinence treated?",
        "Can bowel incontinence be managed?"
      ],
      "responses": [
        "Bowel incontinence is the inability to control bowel movements, leading to accidental leakage.",
        "It can be caused by muscle or nerve damage, constipation, diarrhea, or conditions like Crohn's disease.",
        "Symptoms include the involuntary release of stool and an urgent need to defecate.",
        "Treatment options include dietary changes, pelvic floor exercises, medications, or surgery in severe cases.",
        "Yes, bowel incontinence can often be managed with treatment and lifestyle adjustments."
      ]
    },
    {
      "tag": "bowel_polyps",
      "patterns": [
        "What are bowel polyps?",
        "What causes bowel polyps?",
        "What are the symptoms of bowel polyps?",
        "How are bowel polyps treated?",
        "Can bowel polyps turn into cancer?"
      ],
      "responses": [
        "Bowel polyps are small growths on the lining of the colon or rectum that are usually harmless but can sometimes become cancerous.",
        "They may develop due to genetic factors, age, or a diet high in fat and low in fiber.",
        "Most bowel polyps do not cause symptoms, but some may lead to rectal bleeding or changes in bowel habits.",
        "Treatment involves removing the polyps during a colonoscopy to prevent complications.",
        "Yes, some types of polyps, like adenomas, can develop into cancer over time if left untreated."
      ]
    },
    {
      "tag": "brain_stem_death",
      "patterns": [
        "What is brain stem death?",
        "What causes brain stem death?",
        "How is brain stem death diagnosed?",
        "Can brain stem death be reversed?",
        "What are the signs of brain stem death?"
      ],
      "responses": [
        "Brain stem death occurs when the brain stem stops functioning, leading to a permanent loss of consciousness and the inability to breathe without support.",
        "It can be caused by severe brain injury, stroke, or conditions that lead to brain swelling or oxygen deprivation.",
        "Diagnosis involves a series of clinical tests to check for brain stem reflexes and the ability to breathe independently.",
        "No, brain stem death is irreversible and is legally considered death in most countries.",
        "Signs include the absence of brain stem reflexes, no response to pain, and no independent breathing."
      ]
    },
    {
      "tag": "brain_tumours",
      "patterns": [
        "What are brain tumours?",
        "What causes brain tumours?",
        "What are the symptoms of brain tumours?",
        "How are brain tumours treated?",
        "Are all brain tumours cancerous?"
      ],
      "responses": [
        "Brain tumours are abnormal growths of cells in the brain that can be benign (non-cancerous) or malignant (cancerous).",
        "Causes include genetic mutations, exposure to radiation, or unknown factors.",
        "Symptoms may include persistent headaches, nausea, seizures, vision changes, or difficulty speaking or walking.",
        "Treatment options include surgery, radiation therapy, chemotherapy, or targeted therapy based on the type and location of the tumour.",
        "No, not all brain tumours are cancerous. Benign tumours may still require treatment if they affect brain function."
      ]
    },
    {
      "tag": "brain_tumours_children",
      "patterns": [
        "What are brain tumours in children?",
        "What causes brain tumours in children?",
        "What are the symptoms of brain tumours in children?",
        "How are brain tumours treated in children?",
        "Are brain tumours common in children?"
      ],
      "responses": [
        "Brain tumours in children are abnormal cell growths in the brain that can be benign or malignant.",
        "The exact causes are often unknown, but some may be linked to genetic syndromes or exposure to radiation.",
        "Symptoms include headaches, vomiting, balance problems, behavioral changes, and seizures.",
        "Treatment includes surgery, radiation therapy (used cautiously in younger children), and chemotherapy.",
        "Brain tumours are one of the most common types of cancer in children, but they are still relatively rare."
      ]
    },
    {
      "tag": "brain_tumours_teenagers",
      "patterns": [
        "What are brain tumours in teenagers?",
        "What are the symptoms of brain tumours in young adults?",
        "How are brain tumours treated in teenagers?",
        "What causes brain tumours in young adults?",
        "Are brain tumours common in teenagers?"
      ],
      "responses": [
        "Brain tumours in teenagers and young adults are abnormal growths of cells in the brain that can disrupt normal brain function.",
        "Symptoms include headaches, fatigue, vision changes, mood swings, and difficulty concentrating.",
        "Treatment options include surgery, radiation therapy, and chemotherapy tailored to the tumour's type and location.",
        "Causes are not always clear but may involve genetic predisposition or environmental factors like radiation exposure.",
        "Brain tumours are uncommon in teenagers, but early detection and treatment are critical for better outcomes."
      ]
    },
    {
      "tag": "breast_cancer_female",
      "patterns": [
        "What is breast cancer in women?",
        "What causes breast cancer in females?",
        "What are the symptoms of breast cancer?",
        "How is breast cancer treated?",
        "Is breast cancer common in women?"
      ],
      "responses": [
        "Breast cancer in women is the abnormal growth of cells in the breast tissue, often forming a lump or mass.",
        "Causes include genetic mutations, hormonal factors, and lifestyle factors like alcohol consumption or obesity.",
        "Symptoms include a lump in the breast, changes in breast shape, nipple discharge, or skin changes.",
        "Treatment options include surgery, chemotherapy, radiation therapy, hormone therapy, and targeted therapy.",
        "Yes, breast cancer is one of the most common cancers in women worldwide."
      ]
    },
    {
      "tag": "breast_cancer_male",
      "patterns": [
        "What is breast cancer in men?",
        "What causes breast cancer in males?",
        "What are the symptoms of breast cancer in men?",
        "How is male breast cancer treated?",
        "Is breast cancer rare in men?"
      ],
      "responses": [
        "Breast cancer in men is a rare condition involving the growth of malignant cells in male breast tissue.",
        "Causes include genetic factors, high estrogen levels, and a family history of breast cancer.",
        "Symptoms include a lump in the breast, nipple discharge, and changes in the skin or nipple.",
        "Treatment involves surgery, radiation therapy, chemotherapy, or hormone therapy depending on the stage.",
        "Yes, breast cancer in men is rare, accounting for less than 1% of all breast cancer cases."
      ]
    },
    {
      "tag": "bronchiectasis",
      "patterns": [
        "What is bronchiectasis?",
        "What causes bronchiectasis?",
        "What are the symptoms of bronchiectasis?",
        "How is bronchiectasis treated?",
        "Can bronchiectasis be cured?"
      ],
      "responses": [
        "Bronchiectasis is a chronic lung condition where the airways become permanently widened and inflamed.",
        "It is caused by repeated lung infections, cystic fibrosis, or immune system disorders.",
        "Symptoms include a persistent cough, production of thick mucus, breathlessness, and recurrent chest infections.",
        "Treatment includes airway clearance techniques, antibiotics for infections, and sometimes bronchodilators.",
        "While there is no cure for bronchiectasis, symptoms can be managed to improve quality of life."
      ]
    },
    {
      "tag": "bronchitis",
      "patterns": [
        "What is bronchitis?",
        "What causes bronchitis?",
        "What are the symptoms of bronchitis?",
        "How is bronchitis treated?",
        "Can bronchitis be prevented?"
      ],
      "responses": [
        "Bronchitis is the inflammation of the bronchial tubes, which carry air to and from the lungs.",
        "It is caused by viral infections, bacterial infections, or irritants like smoking and air pollution.",
        "Symptoms include a persistent cough, mucus production, fatigue, shortness of breath, and chest discomfort.",
        "Treatment for bronchitis may involve rest, fluids, cough suppressants, and sometimes antibiotics if caused by bacteria.",
        "To prevent bronchitis, avoid smoking, wear masks in polluted areas, and practice good hygiene to reduce infection risks."
      ]
    },
    {
      "tag": "bulimia_nervosa",
      "patterns": [
        "What is bulimia nervosa?",
        "What causes bulimia nervosa?",
        "What are the symptoms of bulimia nervosa?",
        "How is bulimia nervosa treated?",
        "Is bulimia a serious condition?"
      ],
      "responses": [
        "Bulimia nervosa is an eating disorder characterized by cycles of binge eating followed by purging through vomiting, laxatives, or excessive exercise.",
        "It may be caused by genetic, psychological, societal, or environmental factors.",
        "Symptoms include binge eating, purging behaviors, fear of weight gain, and physical signs like dental erosion and dehydration.",
        "Treatment includes psychotherapy (like CBT), nutritional counseling, and sometimes medications like antidepressants.",
        "Yes, bulimia is a serious condition that can lead to severe health complications, including heart issues and electrolyte imbalances."
      ]
    },
    {
      "tag": "bunion",
      "patterns": [
        "What is a bunion?",
        "What causes bunions?",
        "What are the symptoms of a bunion?",
        "How is a bunion treated?",
        "Can bunions be prevented?"
      ],
      "responses": [
        "A bunion is a bony bump that forms at the base of the big toe, causing the toe to point toward the other toes.",
        "It can be caused by wearing tight or ill-fitting shoes, genetic predisposition, or conditions like arthritis.",
        "Symptoms include pain, swelling, redness, and difficulty walking due to the deformity.",
        "Treatment includes wearing proper footwear, using orthotics, icing, and in severe cases, surgery to realign the bones.",
        "To prevent bunions, wear comfortable shoes with a wide toe box and avoid high heels or tight footwear."
      ]
    },
    {
      "tag": "coronary_heart_disease",
      "patterns": [
        "What is coronary heart disease?",
        "What causes coronary heart disease?",
        "What are the symptoms of coronary heart disease?",
        "How is coronary heart disease treated?",
        "Can coronary heart disease be cured?"
      ],
      "responses": [
        "Coronary heart disease (CHD) occurs when the coronary arteries become narrowed or blocked, reducing blood flow to the heart.",
        "It is caused by a buildup of fatty deposits (atherosclerosis) and risk factors like high cholesterol, smoking, and high blood pressure.",
        "Symptoms include chest pain (angina), shortness of breath, fatigue, and, in severe cases, heart attack.",
        "Treatment includes lifestyle changes, medications, and procedures like angioplasty, stenting, or bypass surgery.",
        "CHD cannot be completely cured, but it can be managed effectively with proper treatment and lifestyle adjustments."
      ]
    },
    {
      "tag": "coronavirus_covid19",
      "patterns": [
        "What is COVID-19?",
        "What causes coronavirus?",
        "What are the symptoms of COVID-19?",
        "How is COVID-19 treated?",
        "Can COVID-19 be prevented?"
      ],
      "responses": [
        "COVID-19 is a respiratory illness caused by the SARS-CoV-2 virus, first identified in 2019.",
        "It spreads through respiratory droplets and close contact with infected individuals.",
        "Symptoms range from mild to severe and include fever, cough, shortness of breath, loss of taste or smell, fatigue, and body aches.",
        "Treatment depends on severity and may include antiviral medications, supportive care, and oxygen therapy in severe cases.",
        "Prevention includes vaccination, wearing masks, maintaining social distance, and practicing good hygiene."
      ]
    },
    {
      "tag": "long_covid",
      "patterns": [
        "What is long COVID?",
        "What are the symptoms of long COVID?",
        "How long do COVID-19 symptoms last?",
        "What causes long COVID?",
        "How is long COVID treated?"
      ],
      "responses": [
        "Long COVID refers to persistent symptoms lasting weeks or months after recovering from the initial COVID-19 infection.",
        "Symptoms include fatigue, brain fog, shortness of breath, chest pain, joint pain, and difficulty concentrating.",
        "The duration varies, with some people recovering in weeks and others experiencing symptoms for months.",
        "The exact cause of long COVID is unclear but may involve lingering inflammation or immune system responses.",
        "Treatment focuses on symptom management, rehabilitation, and addressing specific complications with medical guidance."
      ]
    },
    {
      "tag": "greeting",
      "patterns": ["Hello", "Hi", "How are you?"],
      "responses": [
        "Hello! How can I help you today?",
        "Hi! How can I assist you?"
      ]
    }
  ]
}
