{
    "intents": [
        {
            "tag": "stop_smoking",
            "patterns": ["How do I stop smoking?", "I want to quit smoking.", "What is the best way to stop smoking?"],
            "responses": [
                "Stopping smoking requires willpower and being steadfast. You can stop safely by using bupropion or a nicotine patch under a doctor’s guidance.",
                "Consult an addiction clinic near you for additional support. Wishing you the best in your journey to quit smoking!",
                "It's great that you want to stop smoking! Talk to a healthcare provider for advice on nicotine replacement therapies or medications like bupropion."
            ]
        },
        {
            "tag": "missed_period",
            "patterns": [
                "My period stopped for three months, what could be wrong?",
                "I haven’t had a period in months but I’m not pregnant.",
                "Why has my period stopped suddenly?"
            ],
            "responses": [
                "It’s essential to consult your doctor for hormonal tests like thyroid or prolactin levels to assess the cause of your missed periods.",
                "A tubal ligation makes pregnancy unlikely, but a thorough evaluation by a doctor is recommended.",
                "Endometriosis is an unlikely cause for completely stopping your cycle. Please visit your doctor for an examination."
            ]
        },
        {
            "tag": "breast_tenderness",
            "patterns": [
                "Can caffeine cause breast tenderness?",
                "Why do I have pain in one breast after drinking coffee?",
                "Does caffeine lead to chest discomfort?"
            ],
            "responses": [
                "Excess caffeine can cause gastric discomfort, which may result in breast or chest pain. Consult your doctor for a local evaluation.",
                "Mild unilateral breast tenderness might be linked to your caffeine intake. Stay in touch with your healthcare provider for further guidance.",
                "While caffeine can cause discomfort, other conditions like mastitis should also be ruled out by a healthcare professional."
            ]
        },
        {
            "tag": "farewell",
            "patterns": ["Goodbye", "Bye", "See you later", "Thank you"],
            "responses": ["Goodbye! Take care.", "Bye! Feel free to ask if you have more questions.", "Thank you! Have a great day!"]
        },
        {
            "tag": "blood_cancer",
            "patterns": [
                "What are the symptoms of blood cancer?",
                "How is blood cancer diagnosed?",
                "Can leukemia be treated?",
                "What causes blood cancer?",
                "Is blood cancer hereditary?"
            ],
            "responses": [
                "Blood cancer symptoms can include fatigue, fever, weight loss, and easy bruising. Consult a hematologist for an accurate diagnosis.",
                "Blood cancer is diagnosed using blood tests, bone marrow tests, and imaging studies like CT scans. Talk to your doctor for guidance.",
                "Treatment for blood cancer depends on the type and stage. It may involve chemotherapy, radiation, or a bone marrow transplant. Seek medical advice for more details.",
                "The exact cause of blood cancer isn't fully understood, but genetic factors and exposure to certain chemicals or radiation may play a role.",
                "Some types of blood cancer can have hereditary components, but other factors like lifestyle and environment also contribute."
            ]
        },
        {
            "tag": "brain_tumor",
            "patterns": [
                "What are the signs of a brain tumor?",
                "How is a brain tumor treated?",
                "Can headaches indicate a brain tumor?",
                "What causes brain tumors?",
                "Is surgery always required for brain tumors?"
            ],
            "responses": [
                "Brain tumor symptoms can include persistent headaches, nausea, vision changes, and difficulty speaking or walking. Consult a neurologist for an evaluation.",
                "Treatment for brain tumors depends on the type, size, and location. Options include surgery, radiation therapy, and chemotherapy. Seek medical advice for tailored recommendations.",
                "Frequent headaches can be a symptom of a brain tumor, but many other conditions cause headaches. It's best to consult a healthcare provider for clarification.",
                "The causes of brain tumors can vary. Some may be linked to genetic factors or radiation exposure, but the exact causes aren't always clear.",
                "Surgery is not always required for brain tumors. Some may be treated with medications, radiation, or other therapies. Consult a specialist to discuss your options."
            ]
        },
        

        {
            "tag": "greeting",
            "patterns": ["Hello", "Hi", "How are you?"],
            "responses": ["Hello! How can I help you today?", "Hi! How can I assist you?"]
          }
        
          
    ]
}
